/*Создать класс, который содержит int и char (не проинициализированные) и распечатать их значения.
  Created by slaventiykoss on 13.08.16.
 */
public class First {

    static int x;
    static char cr;

    public static void main(String[] args) {
        System.out.println(First.x);
        System.out.println(First.cr);
    }
}
